## Plan Result (demo-global)




<pre><code>Plan: 42 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;ac-int-gateway-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;adoption-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;bar&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;bar-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-da&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-dn&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-pfe&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-rfe&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;ds-ui&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;dss-update-case&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;et-sya&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fact&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fact-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fees-register&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fees-register-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fis-ds-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;gateway-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;gateway-ccd-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hmcts-access&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-user-dashboard&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-public&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;judicial-payments&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;lau&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;lau-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paybubble&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paybubble-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pcq&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pcq-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;privatelaw&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;probate&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;rpts&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sptribs-frontend&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-cor&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-tribunals&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-tya&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-approve-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-approve-org-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-manage-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-manage-org-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-register-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo"
        name                                 = "hmcts-demo"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (11 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-webapp" -> "healthProbeSettings-fact"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/xui-webapp"
          ~ load_balancing_name = "loadBalancingSettings-xui-webapp" -> "loadBalancingSettings-fact"
          ~ name                = "xui-webapp" -> "fact"

          ~ backend {
              ~ host_header = "manage-case.demo.platform.hmcts.net" -> "fact.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-manage-org" -> "healthProbeSettings-fact-admin"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/xui-manage-org"
          ~ load_balancing_name = "loadBalancingSettings-xui-manage-org" -> "loadBalancingSettings-fact-admin"
          ~ name                = "xui-manage-org" -> "fact-admin"

          ~ backend {
              ~ host_header = "manage-org.demo.platform.hmcts.net" -> "fact-admin.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-manage-org-int" -> "healthProbeSettings-et-sya"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/xui-manage-org-int"
          ~ load_balancing_name = "loadBalancingSettings-xui-manage-org-int" -> "loadBalancingSettings-et-sya"
          ~ name                = "xui-manage-org-int" -> "et-sya"

          ~ backend {
              ~ host_header = "manage-org-int.demo.platform.hmcts.net" -> "et-sya.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-approve-org" -> "healthProbeSettings-xui-webapp"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/xui-approve-org"
          ~ load_balancing_name = "loadBalancingSettings-xui-approve-org" -> "loadBalancingSettings-xui-webapp"
          ~ name                = "xui-approve-org" -> "xui-webapp"

          ~ backend {
              ~ host_header = "administer-orgs.demo.platform.hmcts.net" -> "manage-case.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-fact" -> "healthProbeSettings-xui-manage-org"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/fact"
          ~ load_balancing_name = "loadBalancingSettings-fact" -> "loadBalancingSettings-xui-manage-org"
          ~ name                = "fact" -> "xui-manage-org"

          ~ backend {
              ~ host_header = "fact.demo.platform.hmcts.net" -> "manage-org.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-approve-org-int" -> "healthProbeSettings-xui-manage-org-int"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/xui-approve-org-int"
          ~ load_balancing_name = "loadBalancingSettings-xui-approve-org-int" -> "loadBalancingSettings-xui-manage-org-int"
          ~ name                = "xui-approve-org-int" -> "xui-manage-org-int"

          ~ backend {
              ~ host_header = "administer-orgs-int.demo.platform.hmcts.net" -> "manage-org-int.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-fact-admin" -> "healthProbeSettings-xui-approve-org"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/fact-admin"
          ~ load_balancing_name = "loadBalancingSettings-fact-admin" -> "loadBalancingSettings-xui-approve-org"
          ~ name                = "fact-admin" -> "xui-approve-org"

          ~ backend {
              ~ host_header = "fact-admin.demo.platform.hmcts.net" -> "administer-orgs.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-et-sya" -> "healthProbeSettings-xui-approve-org-int"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/et-sya"
          ~ load_balancing_name = "loadBalancingSettings-et-sya" -> "loadBalancingSettings-xui-approve-org-int"
          ~ name                = "et-sya" -> "xui-approve-org-int"

          ~ backend {
              ~ host_header = "et-sya.demo.platform.hmcts.net" -> "administer-orgs-int.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-gateway-ccd" -> "healthProbeSettings-xui-register-org"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/gateway-ccd"
          ~ load_balancing_name = "loadBalancingSettings-gateway-ccd" -> "loadBalancingSettings-xui-register-org"
          ~ name                = "gateway-ccd" -> "xui-register-org"

          ~ backend {
              ~ host_header = "gateway-ccd.demo.platform.hmcts.net" -> "register-org.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-gateway-ccd-int" -> "healthProbeSettings-gateway-ccd"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/gateway-ccd-int"
          ~ load_balancing_name = "loadBalancingSettings-gateway-ccd-int" -> "loadBalancingSettings-gateway-ccd"
          ~ name                = "gateway-ccd-int" -> "gateway-ccd"

          ~ backend {
              ~ host_header = "gateway-ccd-int.demo.platform.hmcts.net" -> "gateway-ccd.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-register-org" -> "healthProbeSettings-gateway-ccd-int"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/xui-register-org"
          ~ load_balancing_name = "loadBalancingSettings-xui-register-org" -> "loadBalancingSettings-gateway-ccd-int"
          ~ name                = "xui-register-org" -> "gateway-ccd-int"

          ~ backend {
              ~ host_header = "register-org.demo.platform.hmcts.net" -> "gateway-ccd-int.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-paymentoutcome-web" -> "healthProbeSettings-rpts"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/paymentoutcome-web"
          ~ load_balancing_name = "loadBalancingSettings-paymentoutcome-web" -> "loadBalancingSettings-rpts"
          ~ name                = "paymentoutcome-web" -> "rpts"

          ~ backend {
              ~ host_header = "paymentoutcome-web.demo.platform.hmcts.net" -> "rpts.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-paymentoutcome-web-int" -> "healthProbeSettings-dss-update-case"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/paymentoutcome-web-int"
          ~ load_balancing_name = "loadBalancingSettings-paymentoutcome-web-int" -> "loadBalancingSettings-dss-update-case"
          ~ name                = "paymentoutcome-web-int" -> "dss-update-case"

          ~ backend {
              ~ address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> "firewall-nonprodi-palo-cftapimgmtdemo.uksouth.cloudapp.azure.com"
              ~ host_header = "paymentoutcome-web-int.demo.platform.hmcts.net" -> "dss-update-case.demo.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-fis-ds-update-web" -> "healthProbeSettings-fis-ds-web"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/fis-ds-update-web"
          ~ load_balancing_name = "loadBalancingSettings-fis-ds-update-web" -> "loadBalancingSettings-fis-ds-web"
          ~ name                = "fis-ds-update-web" -> "fis-ds-web"

          ~ backend {
              ~ address     = "firewall-nonprodi-palo-cftapimgmtdemo.uksouth.cloudapp.azure.com" -> "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              ~ host_header = "dss-update-case.demo.platform.hmcts.net" -> "fis-ds-web.demo.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-fis-ds-web" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/fis-ds-web" -> null
          - load_balancing_name = "loadBalancingSettings-fis-ds-web" -> null
          - name                = "fis-ds-web" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "fis-ds-web.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }

      ~ backend_pool_health_probe {
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-approve-org"
          ~ name                = "healthProbeSettings-xui-approve-org" -> "healthProbeSettings-fact"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-fact"
          ~ name                = "healthProbeSettings-fact" -> "healthProbeSettings-fact-admin"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-fact-admin"
          ~ name                = "healthProbeSettings-fact-admin" -> "healthProbeSettings-et-sya"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-register-org"
          ~ name                = "healthProbeSettings-xui-register-org" -> "healthProbeSettings-xui-webapp"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-gateway-ccd"
          ~ name                = "healthProbeSettings-gateway-ccd" -> "healthProbeSettings-xui-manage-org"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-et-sya"
          ~ name                = "healthProbeSettings-et-sya" -> "healthProbeSettings-xui-manage-org-int"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-webapp"
          ~ name                = "healthProbeSettings-xui-webapp" -> "healthProbeSettings-xui-approve-org"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-manage-org-int"
          ~ name                = "healthProbeSettings-xui-manage-org-int" -> "healthProbeSettings-xui-approve-org-int"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-gateway-ccd-int"
          ~ name                = "healthProbeSettings-gateway-ccd-int" -> "healthProbeSettings-xui-register-org"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-manage-org"
          ~ name                = "healthProbeSettings-xui-manage-org" -> "healthProbeSettings-gateway-ccd"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-approve-org-int"
          ~ name                = "healthProbeSettings-xui-approve-org-int" -> "healthProbeSettings-gateway-ccd-int"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-pcq"
          ~ name                = "healthProbeSettings-pcq" -> "healthProbeSettings-ac-int-gateway-ccd"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-ac-int-gateway-ccd"
          ~ name                = "healthProbeSettings-ac-int-gateway-ccd" -> "healthProbeSettings-pcq"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-paymentoutcome-web"
          ~ name                = "healthProbeSettings-paymentoutcome-web" -> "healthProbeSettings-rpts"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-fis-ds-update-web"
          ~ name                = "healthProbeSettings-fis-ds-update-web" -> "healthProbeSettings-dss-update-case"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-paymentoutcome-web-int"
          ~ name                = "healthProbeSettings-paymentoutcome-web-int" -> "healthProbeSettings-fis-ds-web"
            # (5 unchanged attributes hidden)
        }
      - backend_pool_health_probe {
          - enabled             = true -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-fis-ds-web" -> null
          - interval_in_seconds = 120 -> null
          - name                = "healthProbeSettings-fis-ds-web" -> null
          - path                = "/health/liveness" -> null
          - probe_method        = "GET" -> null
          - protocol            = "Http" -> null
        }

      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/d025fece-c

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

 true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/paybubble"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["paybubble-int"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/paybubble-int"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["pcq"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/pcq"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["pcq-int"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/pcq-int"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["privatelaw"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/privatelaw"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["probate"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/probate"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["rpts"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/rpts"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["sptribs-frontend"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/sptribs-frontend"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["sscs-cor"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/sscs-cor"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["sscs-tribunals"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/sscs-tribunals"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["sscs-tya"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/sscs-tya"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-approve-org"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-approve-org"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-approve-org-int"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-approve-org-int"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-manage-org"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-manage-org"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-manage-org-int"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-manage-org-int"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-register-org"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-register-org"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-webapp"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-webapp"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 42 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1477,"Program":"tfcmt","SHA1":"","Target":"demo-global","Vars":{}} -->